baseScreen.yml
config:
  target: https://www.hlavnydennik.sk
  phases:
      - arrivalCount: 1
        duration: 10
      - arrivalCount: 120
        duration: 60

  # Load the Playwright engine:
  engines:
    playwright:
      launchOptions:
        headless: true
      defaultNavigationTimeout: 60
  # Path to JavaScript file that defines Playwright test functions
  processor: "./tests/prinosneInformacie.js"
scenarios:
  - name: "fujDennikSme"
    engine: playwright
    testFunction: "doleziteFaktyPerformance"